In [17]:
import pandas as pd
data = pd.read_csv(r"C:\Users\pooji\Downloads\NewspaperData.csv")
data.head()

            Newspaper    daily   sunday
0       Baltimore Sun  391.952  488.506
1        Boston Globe  516.981  798.298
2       Boston Herald  355.628  235.084
3  Charlotte Observer  238.555  299.451
4   Chicago Sun Times  537.780  559.093

In [18]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 34 entries, 0 to 33
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Newspaper  34 non-null     object
 1   daily      34 non-null     float64
 2   sunday     34 non-null     float64
dtypes: float64(2), object(1)
memory usage: 948.0+ bytes

In [19]:
data.duplicated()

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13    False
14    False
15    False
16    False
17    False
18    False
19    False
20    False
21    False
22    False
23    False
24    False
25    False
26    False
27    False
28    False
29    False
30    False
31    False
32    False
33    False
dtype: bool

In [20]:
data.shape

(34, 3)

In [26]:
data.tail()

                  Newspaper    daily    sunday
29  San Francisco Chronicle  570.364   704.322
30  St. Louis Post-Dispatch  391.286   585.681
31   St. Paul Pioneer Press  201.860   267.781
32            Tampa Tribune  321.626   408.343
33          Washington Post  838.902  1165.567

In [33]:
data.isnull().sum()

Newspaper    0
daily        0
sunday       0
dtype: int64

In [39]:
data.sample(10)

                     Newspaper     daily    sunday
10           Houston Chronicle   449.755   620.752
14                Miami Herald   444.581   553.479
16  New Orleans Times-Picayune   272.280   324.241
15    Minneapolis Star Tribune   412.871   685.975
24          Portland Oregonian   337.672   440.923
18              New York Times  1209.225  1762.015
2                Boston Herald   355.628   235.084
28              Sacramento Bee   273.844   338.355
13           Los Angeles Times  1164.388  1531.527
32               Tampa Tribune   321.626   408.343

In [55]:
data.drop('Newspaper',axis=1).corr()

           daily    sunday
daily   1.000000  0.958154
sunday  0.958154  1.000000

In [59]:
import warnings
warnings.filterwarnings('ignore')